Revit 2024 API
CylindricalSurface.Radius Property
 Radius of the circle that defines the base of this cylinder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double Radius { get; }
Visual Basic
Public ReadOnly Property Radius As Double
	Get
Visual C++
public:
property double Radius {
	double get ();
}
See Also
CylindricalSurface Class
Autodesk.Revit.DB Namespace